{
  "common": {
    "back": "Atrás",
    "backToHome": "Volver al Inicio",
    "contact": "Contacto",
    "email": "hi@inspiroware.com",
    "lastUpdated": "Última actualización",
    "validFrom": "Válido desde",
    "company": "Inspiroware OÜ",
    "registrationNumber": "16234567",
    "location": "Tallinn, Estonia",
    "vatId": "EE102345678"
  },
  "imprint": {
    "title": "Aviso Legal",
    "subtitle": "Información según § 5 TMG",
    "provider": "Proveedor",
    "management": "Gestión",
    "manager": "Director Gerente: Mike Lepcsik",
    "registry": "Entrada de Registro",
    "registryCourt": "Tribunal de Registro: Äriregister (Registro Comercial de Estonia)",
    "euDispute": "Resolución de Disputas UE",
    "euDisputeText": "La Comisión Europea proporciona una plataforma para la resolución de disputas en línea (ODR):",
    "euDisputeContact": "Puedes encontrar nuestra dirección de correo electrónico arriba en el aviso legal.",
    "consumerDispute": "Resolución de Disputas del Consumidor",
    "consumerDisputeText": "No estamos dispuestos u obligados a participar en procedimientos de resolución de disputas ante una junta de arbitraje de consumidores.",
    "contentLiability": "Responsabilidad por el Contenido",
    "contentLiabilityText1": "Como proveedor de servicios, somos responsables de nuestro propio contenido en estas páginas según las leyes generales de acuerdo con § 7 para. 1 TMG. Según §§ 8 a 10 TMG, sin embargo, nosotros como proveedor de servicios no tenemos la obligación de monitorear información de terceros transmitida o almacenada o investigar circunstancias que indiquen actividad ilegal.",
    "contentLiabilityText2": "Las obligaciones de eliminar o bloquear el uso de información según las leyes generales permanecen sin verse afectadas. Sin embargo, la responsabilidad al respecto solo es posible desde el momento en que se conoce una infracción específica de la ley.",
    "linkLiability": "Responsabilidad por Enlaces",
    "linkLiabilityText": "Nuestra oferta contiene enlaces a sitios web externos de terceros, sobre cuyos contenidos no tenemos influencia. Por lo tanto, no podemos asumir ninguna responsabilidad por estos contenidos ajenos. El respectivo proveedor u operador de las páginas siempre es responsable del contenido de las páginas enlazadas.",
    "copyright": "Derechos de Autor",
    "copyrightText": "El contenido y las obras creadas por los operadores del sitio en estas páginas están sujetos a la ley de derechos de autor alemana. La duplicación, procesamiento, distribución y cualquier forma de comercialización de dicho material más allá del alcance de la ley de derechos de autor requerirá el consentimiento previo por escrito de su respectivo autor o creador."
  },
  "privacy": {
    "title": "Política de Privacidad",
    "controller": "Controlador de Datos",
    "controllerText": "Responsable del procesamiento de datos es:",
    "dataTypes": "Tipos de Datos Procesados",
    "dataTypesText": "Procesamos las siguientes categorías de datos:",
    "domainData": "Datos de Dominio: URLs de sitios web ingresadas por usted para análisis",
    "analysisResults": "Resultados de Análisis: Datos técnicos sobre sitios web escaneados (estado SSL, métricas de rendimiento, meta tags)",
    "usageData": "Datos de Uso: Número de escaneos realizados, características utilizadas",
    "technicalData": "Datos Técnicos: Dirección IP, información del navegador, tiempos de acceso",
    "purpose": "Propósito del Procesamiento de Datos",
    "purposeText": "El procesamiento de datos se lleva a cabo para los siguientes propósitos:",
    "serviceProvision": "Provisión de servicios de análisis de sitios web",
    "serviceImprovement": "Mejora de nuestros servicios",
    "technicalSecurity": "Seguridad técnica y diagnóstico de errores",
    "legalCompliance": "Cumplimiento de obligaciones legales",
    "legalBasis": "Base Legal",
    "legalBasisText": "El procesamiento se basa en el Art. 6 para. 1 lit. b GDPR (cumplimiento del contrato) y Art. 6 para. 1 lit. f GDPR (intereses legítimos para proporcionar y mejorar nuestros servicios).",
    "dataSharing": "Compartir Datos",
    "dataSharingText": "Utilizamos APIs externas para el análisis de sitios web:",
    "googlePageSpeed": "API Google PageSpeed: Para análisis de rendimiento",
    "dnsServices": "Servicios DNS: Para verificación técnica de dominios",
    "dataSharingNote": "Estos servicios solo reciben los datos necesarios (URLs de dominio) para realizar el análisis.",
    "rights": "Sus Derechos",
    "rightsText": "Tiene los siguientes derechos:",
    "rightAccess": "Acceso a sus datos almacenados (Art. 15 GDPR)",
    "rightRectification": "Rectificación de datos incorrectos (Art. 16 GDPR)",
    "rightErasure": "Eliminación de sus datos (Art. 17 GDPR)",
    "rightRestriction": "Restricción del procesamiento (Art. 18 GDPR)",
    "rightPortability": "Portabilidad de datos (Art. 20 GDPR)",
    "rightObjection": "Objeción al procesamiento (Art. 21 GDPR)",
    "rightsContact": "Para ejercer sus derechos, contáctenos en:",
    "contactSection": "Contacto",
    "contactText": "Para preguntas sobre protección de datos, contáctenos en:"
  }
}