{
  "common": {
    "back": "Atrás",
    "backToHome": "Volver al Inicio",
    "contact": "Contacto",
    "email": "hi@inspiroware.com",
    "lastUpdated": "Última actualización",
    "validFrom": "Válido desde",
    "company": "Inspiroware OÜ",
    "registrationNumber": "16234567",
    "location": "Tallinn, Estonia",
    "vatId": "EE102345678"
  },
  "imprint": {
    "title": "Aviso Legal",
    "subtitle": "Información según § 5 TMG",
    "provider": "Proveedor",
    "management": "Gestión",
    "manager": "Director Gerente: Mike Lepcsik",
    "registry": "Entrada de Registro",
    "registryCourt": "Tribunal de Registro: Äriregister (Registro Comercial de Estonia)",
    "euDispute": "Resolución de Disputas UE",
    "euDisputeText": "La Comisión Europea proporciona una plataforma para la resolución de disputas en línea (ODR):",
    "euDisputeContact": "Puedes encontrar nuestra dirección de correo electrónico arriba en el aviso legal.",
    "consumerDispute": "Resolución de Disputas del Consumidor",
    "consumerDisputeText": "No estamos dispuestos u obligados a participar en procedimientos de resolución de disputas ante una junta de arbitraje de consumidores.",
    "contentLiability": "Responsabilidad por el Contenido",
    "contentLiabilityText1": "Como proveedor de servicios, somos responsables de nuestro propio contenido en estas páginas según las leyes generales de acuerdo con § 7 para. 1 TMG. Según §§ 8 a 10 TMG, sin embargo, nosotros como proveedor de servicios no tenemos la obligación de monitorear información de terceros transmitida o almacenada o investigar circunstancias que indiquen actividad ilegal.",
    "contentLiabilityText2": "Las obligaciones de eliminar o bloquear el uso de información según las leyes generales permanecen sin verse afectadas. Sin embargo, la responsabilidad al respecto solo es posible desde el momento en que se conoce una infracción específica de la ley.",
    "linkLiability": "Responsabilidad por Enlaces",
    "linkLiabilityText": "Nuestra oferta contiene enlaces a sitios web externos de terceros, sobre cuyos contenidos no tenemos influencia. Por lo tanto, no podemos asumir ninguna responsabilidad por estos contenidos ajenos. El respectivo proveedor u operador de las páginas siempre es responsable del contenido de las páginas enlazadas.",
    "copyright": "Derechos de Autor",
    "copyrightText": "El contenido y las obras creadas por los operadores del sitio en estas páginas están sujetos a la ley de derechos de autor alemana. La duplicación, procesamiento, distribución y cualquier forma de comercialización de dicho material más allá del alcance de la ley de derechos de autor requerirá el consentimiento previo por escrito de su respectivo autor o creador."
  },
  "privacy": {
    "title": "Política de Privacidad",
    "controller": "Controlador de Datos",
    "controllerText": "Responsable del procesamiento de datos es:",
    "dataTypes": "Tipos de Datos Procesados",
    "dataTypesText": "Procesamos las siguientes categorías de datos:",
    "domainData": "Datos de Dominio: URLs de sitios web ingresadas por usted para análisis",
    "analysisResults": "Resultados de Análisis: Datos técnicos sobre sitios web escaneados (estado SSL, métricas de rendimiento, meta tags)",
    "usageData": "Datos de Uso: Número de escaneos realizados, características utilizadas",
    "technicalData": "Datos Técnicos: Dirección IP, información del navegador, tiempos de acceso",
    "purpose": "Propósito del Procesamiento de Datos",
    "purposeText": "El procesamiento de datos se lleva a cabo para los siguientes propósitos:",
    "serviceProvision": "Provisión de servicios de análisis de sitios web",
    "serviceImprovement": "Mejora de nuestros servicios",
    "technicalSecurity": "Seguridad técnica y diagnóstico de errores",
    "legalCompliance": "Cumplimiento de obligaciones legales",
    "legalBasis": "Base Legal",
    "legalBasisText": "El procesamiento se basa en el Art. 6 para. 1 lit. b GDPR (cumplimiento del contrato) y Art. 6 para. 1 lit. f GDPR (intereses legítimos para proporcionar y mejorar nuestros servicios).",
    "dataSharing": "Compartir Datos",
    "dataSharingText": "Utilizamos APIs externas para el análisis de sitios web:",
    "googlePageSpeed": "API Google PageSpeed: Para análisis de rendimiento",
    "dnsServices": "Servicios DNS: Para verificación técnica de dominios",
    "dataSharingNote": "Estos servicios solo reciben los datos necesarios (URLs de dominio) para realizar el análisis.",
    "rights": "Sus Derechos",
    "rightsText": "Tiene los siguientes derechos:",
    "rightAccess": "Acceso a sus datos almacenados (Art. 15 GDPR)",
    "rightRectification": "Rectificación de datos incorrectos (Art. 16 GDPR)",
    "rightErasure": "Eliminación de sus datos (Art. 17 GDPR)",
    "rightRestriction": "Restricción del procesamiento (Art. 18 GDPR)",
    "rightPortability": "Portabilidad de datos (Art. 20 GDPR)",
    "rightObjection": "Objeción al procesamiento (Art. 21 GDPR)",
    "rightsContact": "Para ejercer sus derechos, contáctenos en:",
    "contactSection": "Contacto",
    "contactText": "Para preguntas sobre protección de datos, contáctenos en:"
  },
  "terms": {
    "title": "Términos y Condiciones",
    "validFrom": "Válido desde: Enero 2025",
    "scope": {
      "title": "§ 1 Alcance",
      "text1": "Estos Términos y Condiciones Generales (Términos) se aplican a todos los contratos entre Inspiroware OÜ (en adelante \"Proveedor\") y los usuarios de la plataforma DomainAudit Pro (en adelante \"Usuario\") sobre el uso de servicios de análisis de sitios web.",
      "text2": "Las condiciones conflictivas o divergentes del usuario no son reconocidas a menos que su validez sea expresamente confirmada por escrito."
    },
    "services": {
      "title": "§ 2 Objeto del Contrato",
      "text": "El proveedor ofrece una plataforma web que permite:",
      "feature1": "Análisis técnico de sitios web (SSL, rendimiento, SEO)",
      "feature2": "Procesamiento por lotes de listas de dominios",
      "feature3": "Exportación de resultados de análisis",
      "feature4": "Acceso API para consultas automatizadas (Plan Enterprise)",
      "plans": "Los servicios se ofrecen en diferentes planes (Gratuito, Enterprise)."
    },
    "usage": {
      "title": "§ 3 Derechos y Obligaciones de Uso",
      "allowedTitle": "Uso Permitido:",
      "allowed1": "Uso comercial y privado dentro de los límites del plan seleccionado",
      "allowed2": "Análisis de sitios web que está autorizado a analizar o que son públicamente accesibles",
      "allowed3": "Exportación y reutilización de resultados de análisis",
      "prohibitedTitle": "Uso Prohibido:",
      "prohibited1": "Mal uso de la plataforma para propósitos ilegales",
      "prohibited2": "Sobrecarga del servidor a través de solicitudes excesivas",
      "prohibited3": "Ingeniería inversa o copia del software",
      "prohibited4": "Reventa o sublicencia sin consentimiento"
    },
    "pricing": {
      "title": "§ 4 Precios y Términos de Pago",
      "freePlanTitle": "Plan Gratuito:",
      "free1": "Gratuito",
      "free2": "1 escaneo de dominio por día",
      "free3": "Características básicas",
      "enterpriseTitle": "Plan Enterprise:",
      "enterprise1": "Precios según lista actual de precios",
      "enterprise2": "Escaneos ilimitados",
      "enterprise3": "Todas las características premium",
      "enterprise4": "Facturación mensual o anual",
      "vatNote": "Todos los precios están sujetos al IVA aplicable. El pago se realiza por adelantado mediante tarjeta de crédito o débito directo SEPA."
    },
    "termination": {
      "title": "§ 5 Duración y Terminación",
      "freePlan": "Plan Gratuito: Puede terminarse en cualquier momento sin aviso.",
      "enterprisePlan": "Plan Enterprise: El término mínimo es de un mes. El contrato se renueva automáticamente por el período seleccionado a menos que se termine con 30 días de aviso antes del final del término.",
      "notice": "Las terminaciones deben hacerse por escrito (el correo electrónico es suficiente) a hi@inspiroware.com."
    },
    "availability": {
      "title": "§ 6 Disponibilidad y Garantía",
      "uptime": "El proveedor apunta a una disponibilidad del 99% pero no puede garantizarla. El trabajo de mantenimiento se anunciará cuando sea posible.",
      "dataAccuracy": "Los resultados del análisis se basan en datos públicamente disponibles y APIs externas. No se da garantía por la precisión y completitud.",
      "defects": "Los defectos deben reportarse inmediatamente por escrito. Para quejas justificadas, el proveedor remediará el defecto o reducirá la compensación en consecuencia."
    },
    "liability": {
      "title": "§ 7 Responsabilidad",
      "limitation": "La responsabilidad del proveedor está limitada a intención y negligencia grave. No hay responsabilidad por daños indirectos, pérdida de ganancias o daños consecuentes, excepto en caso de incumplimiento de obligaciones contractuales esenciales.",
      "cap": "La responsabilidad está limitada a daños típicamente previsibles, pero no excediendo la compensación pagada en los últimos 12 meses."
    },
    "dataProtection": {
      "title": "§ 8 Protección de Datos",
      "text": "El procesamiento de datos personales se lleva a cabo de acuerdo con la Política de Privacidad, que es parte de estos Términos.",
      "privacyLink": "Política de Privacidad"
    },
    "changes": {
      "title": "§ 9 Cambios en los Términos",
      "text": "El proveedor puede cambiar estos Términos con 30 días de aviso. Si el usuario no objeta dentro de 30 días de recibir la notificación de cambio, los cambios se consideran aprobados."
    },
    "final": {
      "title": "§ 10 Disposiciones Finales",
      "law": "Se aplica la ley de Estonia, excluyendo la Convención de las Naciones Unidas sobre los Contratos de Compraventa Internacional de Mercaderías.",
      "jurisdiction": "El lugar de jurisdicción es Tallinn, Estonia.",
      "severability": "Si las disposiciones individuales de estos Términos son inválidas, la validez de las disposiciones restantes permanece inalterada."
    },
    "contactTitle": "Contacto",
    "contactText": "Para preguntas sobre estos Términos, contáctenos en:"
  },
  "cookies": {
    "title": "Configuración de Cookies",
    "description": "Aquí puede gestionar sus preferencias de cookies. Respetamos su privacidad y le damos control total sobre qué cookies se almacenan en su dispositivo.",
    "categories": {
      "necessary": {
        "title": "Cookies Necesarias",
        "description": "Estas cookies son esenciales para el funcionamiento adecuado del sitio web. Permiten funciones básicas como navegación de páginas y acceso a áreas seguras del sitio web.",
        "detail1": "Gestión de sesiones",
        "detail2": "Características de seguridad",
        "detail3": "Funcionalidad básica del sitio web",
        "duration": "Sesión / 1 año"
      },
      "analytics": {
        "title": "Cookies de Análisis",
        "description": "Estas cookies recopilan información sobre cómo los visitantes usan nuestro sitio web. Toda la información se anonimiza y nos ayuda a mejorar el rendimiento del sitio web.",
        "detail1": "Estadísticas de uso del sitio web",
        "detail2": "Métricas de rendimiento",
        "detail3": "Reporte de errores",
        "duration": "2 años"
      },
      "marketing": {
        "title": "Cookies de Marketing",
        "description": "Estas cookies se utilizan para hacer que la publicidad sea más relevante y medir la efectividad de las campañas publicitarias.",
        "detail1": "Publicidad personalizada",
        "detail2": "Seguimiento de campañas",
        "detail3": "Retargeting",
        "duration": "1 año"
      },
      "preferences": {
        "title": "Cookies de Preferencias",
        "description": "Estas cookies permiten al sitio web recordar sus elecciones y proporcionarle características mejoradas y más personalizadas.",
        "detail1": "Preferencias de idioma y región",
        "detail2": "Configuraciones de UI",
        "detail3": "Contenido personalizado",
        "duration": "1 año"
      }
    },
    "required": "Requerido",
    "purposesTitle": "Propósitos:",
    "durationTitle": "Duración de almacenamiento:",
    "saveChanges": "Guardar Cambios",
    "saveButton": "Guardar Configuración",
    "saveDescription": "Haga clic en \"Guardar\" para actualizar sus preferencias de cookies.",
    "savedToast": "Configuración guardada",
    "savedDescription": "Sus preferencias de cookies han sido actualizadas exitosamente.",
    "additionalInfo": "Información Adicional",
    "contactInfo": "Si tiene preguntas sobre nuestras políticas de cookies, contáctenos en",
    "privacyInfo": "Más información se puede encontrar en nuestra",
    "privacyLink": "Política de Privacidad"
  }
}